import React from "react";

const HomePage = () => {
  return (
    <div>
      <h1>HomePage</h1>
      <p>
        Привет! Меня зовут Дмитрий. Я учусь на{" "}
        <strong>Junior FullStack разработчика на языке Java Script</strong> В
        этом проекте я делаю сайт на React и MobX
      </p>
      <p>
        MobX я изучаю самостоятельно и использую примеры из интернета. Многие
        примеры используют уже устаревшие решения, методы или классы. Я
        воспроивожу их, в этом проекте, использую современные версии библиотек.
      </p>
      <p>
        Многое мне еще тяжело и не понятно. Что то вылетает из головы. Но я
        знаю, что <strong>Дорогу осилит идущий</strong>
      </p>
      <hr />
      <p>
        Проекты Likes - проект, в котором пользователи могут реагировать на
        изображения и комментировать их. Ссылка на оригинальный проект{" "}
        <a
          href="https://dev.to/rosyshrestha/build-your-first-app-with-mobx-and-react-4896"
          target="_blank"
        >
          Click
        </a>
      </p>
    </div>
  );
};

export default HomePage;
